Repository: 24-25J-066-Research-Cinnex/Cinnex-MobileApp
Catalog: lib/l10n/app_*.arb
Languages: si

# title
source: Hello
si: හෙලෝ

# home
source: Chat
si: කතාබහ

source: Dashboard
si: උපකරණ

source: Profile
si: පැතිකඩ

source: Settings
si: සැකසුම්

source: storage
si: ගොනු

source: Notification
si: දැනුම්දීම්

source: skip
si: මඟ හරින්න

source: next
si: ඊළඟ

source: Get Started
si: ආරම්භ කරන්න

source: Select Language
si: භාෂාව තෝරන්න

source: Price Forecast
si: මිල අනාවැකිය

# price_forecast_continue
source: Continue
si: ඉදිරියට යන්න

# price_forecast_landing_content1
source: Here, you can access an exclusive price forecast for cinnamon, offering valuable insights for better price prediction. This tool helps farmers, traders, and business owners make informed decisions, plan future investments, and optimize profits. By analyzing market trends and historical data, the forecast ensures accuracy and reliability, empowering you to stay ahead in the competitive cinnamon industry.
si: මෙහි, ඔබට කුරුඳු සඳහා සුවිශේෂී මිල පුරෝකථනයකට ප්‍රවේශ විය හැක, වඩා හොඳ මිල අනාවැකි සඳහා වටිනා අවබෝධයක් ලබා දෙයි. මෙම මෙවලම ගොවීන්ට, වෙළඳුන්ට සහ ව්‍යාපාර හිමියන්ට දැනුවත් තීරණ ගැනීමට, අනාගත ආයෝජන සැලසුම් කිරීමට සහ ලාභ ප්‍රශස්ත කිරීමට උපකාරී වේ. වෙළඳපල විශ්ලේෂණය කිරීමෙන් ප්‍රවණතා සහ ඓතිහාසික දත්ත, පුරෝකථනය නිරවද්‍යතාවය සහ විශ්වසනීයත්වය සහතික කරයි.

# price_forecast_landing_content2
source: Here, you can get an exclusive price forecast for cinnamon, which provides a great insight for better price prediction.
si: මෙහි, ඔබට කුරුඳු සඳහා සුවිශේෂී මිල පුරෝකථනයක් ලබා ගත හැක, එය වඩා හොඳ මිල අනාවැකි සඳහා විශිෂ්ට අවබෝධයක් සපයයි.

# price_forecast_landing_content3
source: 1.Select the Date: Choose the desired date for the price forecast. 2.Enter Location: Provide the specific region or market where the cinnamon is being sold. 3.Specify Cinnamon Grade: Input the grade or quality of the cinnamon accurately. 4.Submit Data: Confirm all inputs and submit them in the app's price prediction feature. 5.Review Forecast: Analyze the predicted price for the selected date and location. 6.Plan Accordingly: Use the forecast to make informed decisions on sales or purchases.
si: 1. දිනය තෝරන්න: මිල පුරෝකථනය සඳහා අවශ්‍ය දිනය තෝරන්න. 2. ස්ථානය ඇතුළු කරන්න: කුරුඳු විකුණනු ලබන නිශ්චිත කලාපය හෝ වෙළඳපොළ සපයන්න. 3. කුරුඳු ශ්‍රේණිය සඳහන් කරන්න: කුරුඳු වල ශ්‍රේණිය හෝ ගුණාත්මකභාවය නිවැරදිව ඇතුළත් කරන්න 4.දත්ත ඉදිරිපත් කරන්න: සියලුම යෙදවුම් තහවුරු කර ඒවා යෙදුමේ මිල අනාවැකි විශේෂාංගය තුළ ඉදිරිපත් කරන්න. 5.සමාලෝචන පුරෝකථනය: තෝරාගත් දිනය සහ ස්ථානය සඳහා පුරෝකථනය කළ මිල විශ්ලේෂණය කරන්න. 6.ඒ අනුව සැලසුම් කරන්න:විකුණුම් හෝ මිලදී ගැනීම් පිළිබඳ දැනුවත් තීරණ ගැනීමට අනාවැකිය භාවිත කරන්න.",

# price_forecast_content
source: Enter the required data to make a prediction
si: අනාවැකියක් කිරීමට අවශ්‍ය දත්ත ඇතුලත් කරන්න

# price_forecast_date
source: Select Prediction Date
si: අනාවැකි දිනය තෝරන්න

# price_forecast_grade
source: Select cinnamon Grade
si: කුරුඳු ශ්‍රේණිය තෝරන්න

# price_forecast_region
source: Select Your Region
si: ඔබේ කලාපය තෝරන්න

# price_forecast_button
source: Predict Market Price
si: වෙළඳපල මිල පුරෝකථනය කරන්න

source: Predicted Price
si: පුරෝකථනය කළ මිල

# predicted_price2
source: Price for 1 Kilo Gram of Cinnamon in Sri Lankan Rupees
si: කුරුඳු කිලෝ ග්‍රෑම් 1 ක මිල ශ්‍රී ලංකා රුපියල්

# predicted_snack_bar
source: Please select all required fields
si: කරුණාකර අවශ්‍ය සියලුම ක්ෂේත්‍ර තෝරන්න

# price_ditect_loading
source: Predicting price...
si: මිල පුරෝකථනය කරමින්...

# cinnamon_diseases
source: Diseases Detection
si: රෝග විනිශ්චය

# cinnamon_diseases_landing_content1
source: To accurately identify diseases in cinnamon plants, ensure you upload clear and well-lit images of the affected leaves or plants. Early detection and accurate identification are crucial for effective disease management. Once a diagnosis is provided, promptly follow the recommended treatments to maintain plant health and optimize yields.
si: කුරුඳු පැලවල ඇති රෝග නිවැරදිව හඳුනා ගැනීම සඳහා, බලපෑමට ලක් වූ පත්‍රවල හෝ පැලවල පැහැදිලි සහ හොඳින් ආලෝකමත් රූප උඩුගත කිරීමට වග බලා ගන්න. කල් ඇතිව හඳුනා ගැනීම සහ නිවැරදිව හඳුනා ගැනීම ඵලදායී රෝග කළමනාකරණය සඳහා ඉතා වැදගත් වේ. රෝග විනිශ්චය ලබා දුන් පසු, වහාම ශාක සෞඛ්‍යය පවත්වා ගැනීමට සහ අස්වැන්න ප්‍රශස්ත කිරීමට නිර්දේශිත ප්‍රතිකාර කඩිනමින් අනුගමනය කරන්න.

# cinnamon_diseases_landing_content2
source: 1.Capture Image: Take clear and close-up photos of leaves, focusing on areas with visible spots, discoloration, or damage. Ensure good lighting and avoid blurry images for the best results. 2.Upload Photo to App: Submit the image to the app’s disease detection feature. The AI system analyzes the photo to identify potential diseases. 3.Review Diagnosis: Check the results to identify the proposed disease and learn about its symptoms, causes, and effects on the cinnamon plant. 4.Follow Treatment: Apply the recommended treatments promptly to control the disease. Utilize preventive measures and monitor the plant regularly to prevent recurrence.
si: 1. රූපය ග්‍රහණය කර ගන්න: දෘශ්‍ය ලප, දුර්වර්ණ වීම හෝ හානි සහිත ප්‍රදේශ කෙරෙහි අවධානය යොමු කරමින් කොළවල පැහැදිලි සහ සමීප ඡායාරූප ගන්න. හොඳම ප්‍රතිඵල සඳහා හොඳ ආලෝකය සහතික කර නොපැහැදිලි රූප වළක්වා ගන්න. 2.ඡායාරූපය යෙදුමට උඩුගත කරන්න: යෙදුමේ රෝග හඳුනාගැනීමේ විශේෂාංගයට රූපය ඉදිරිපත් කරන්න, විභව රෝග හඳුනා ගැනීමට AI පද්ධතිය ඡායාරූපය විශ්ලේෂණය කරයි 3.රෝග විනිශ්චය සමාලෝචනය කරන්න: යෝජිත රෝගය හඳුනා ගැනීමට සහ එහි රෝග ලක්ෂණ, හේතූන් සහ කුරුඳු ශාකයේ බලපෑම් පිළිබඳව දැන ගැනීමට ප්‍රතිඵල පරීක්ෂා කරන්න. 4.ප්‍රතිකාරය අනුගමනය කරන්න: රෝගය පාලනය කිරීමට නිර්දේශිත ප්‍රතිකාර ක්‍රම ඉක්මනින් යොදන්න සහ නැවත ඇතිවීම වැලැක්වීම සඳහා ශාකය නිතිපතා අධීක්ෂණය කරන්න, අතිරේක මාර්ගෝපදේශ සඳහා කෘෂිකාර්මික විශේෂඥයින් උපදෙස් ලබා ගැනීම සලකා බලන්න.

# cinnamon_diseases_content
source: Here, you can detect diseases on cinnamon leaves. Please upload a clear image or take a picture of a cinnamon leaf.
si: මෙහිදී, ඔබට කුරුඳු කොළ වල රෝග හඳුනාගත හැක. කරුණාකර පැහැදිලි රූපයක් උඩුගත කරන්න හෝ කුරුඳු කොළයක ඡායාරූපයක් ඇතුළු කරන්න.

# cinnamon_diseases_button0
source: Select file
si: ගොනුව තෝරන්න

# cinnamon_diseases_or
source: Or
si: හෝ

# cinnamon_diseases_button1
source: Open Camera and take photo
si: ඡායාරූපයක් ගන්න

# cinnamon_diseases_button2
source: Predict the Disease
si: රෝගය පුරෝකථනය කරන්න

# cinnamon_diseases_snack_bar
source: Please upload a clear photo to identify the disease.
si: කරුණාකර රෝග හඳුනා ගැනීමට පැහැදිලි ඡායාරූපයක් ඇතුළු කරන්න

source: Predicted Disease
si: රෝග පුරෝකථනය

# disease_ditect_loading
source: Predicting Disease...
si: රෝගය පුරෝකථනය කරමින්...

source: Cinnamon Species
si: කුරුඳු විශේෂ

# cinnamon_species_landing_content1
source: To accurately identify cinnamon species, ensure clear and detailed images of the plant parts such as leaves, bark, or buds are provided.
si: කුරුඳු විශේෂ නිවැරදිව හඳුනා ගැනීම සඳහා, කුරුඳු ශාක පත්‍රවල පැහැදිලි සහ සවිස්තරාත්මක රූප සපයා ඇති බවට සහතික වන්න.

# cinnamon_species_landing_content2
source: Capture Image: Take high-quality photos of the cinnamon plant parts with proper focus and lighting. Upload Photo to App: Submit the image to the app’s species detection feature. Review Analysis: Check results and identify the proposed species. Confirm Characteristics: Compare the app's output with known characteristics for validation.
si: 1.රූපයක් ගන්න: කුරුඳු වෘක්ෂයේ ශාක පත්‍රවල නිවැරදි ආලෝකයෙන් සහ සූක්ෂ්ම අවධානයෙන් රූප ගන්න. 2.යෙදුමට රූපය උඩුගත කරන්න: වර්ග හඳුනාගැනීමේ විශේෂාංගයට රූපය යොමු කරන්න. 3.විශ්ලේෂණය සමාලෝචනය කරන්න: ප්‍රතිඵල පරීක්ෂා කර යෝජිත වර්ගය හඳුනා ගන්න. 4.ගුණාංග තහවුරු කරන්න: යෙදුමේ ප්‍රතිඵලය හඳුනාගත් ගුණාංගවලට සමාන බව සසඳන්න.

# cinnamon_species_content
source: Please upload an image or take a photo of your cinnamon plant.
si: කරුණාකර පින්තූරයක් උඩුගත කරන්න හෝ ඔබේ කුරුඳු කොළවල ඡායාරූපයක් ගන්න.

# cinnamon_species_button0
source: Select File
si: ගොනුව තෝරන්න

# cinnamon_species_or
source: Or
si: හෝ

# cinnamon_species_button1
source: Open Camera and Take Photo
si: කැමරාව විවෘත කර රූපයක් ගන්න

# cinnamon_species_button2
source: Identify the Species
si: වර්ගය හඳුනාගන්න

source: Predicted Species
si: පුරෝකථනය කළ වර්ගය

# species_ditect_loading
source: Predicting Species...
si: වර්ගය පුරෝකථනය කරමින්...

source: Cinnamon Grades
si: කුරුඳු ශ්‍රේණි

# cinnamon_grades_landing_content1
source: To assess the grade of cinnamon, provide high-resolution images focusing on the bark or quills of the cinnamon.
si: කුරුඳු ශ්‍රේණිය තක්සේරු කිරීම සඳහා, කුරුඳු කුයිල්වල අධි-විභේදන රූප ලබා දෙන්න.

# cinnamon_grades_landing_content2
source: Capture Image: Take close-up photos of the cinnamon bark or quills, ensuring proper lighting and sharp focus. Upload Photo to App: Submit the image to the app’s grade detection feature. Review Grade: View the predicted grade and details of the cinnamon quality. Take Action: Use the grading results to make informed decisions about processing or selling.
si: 1.රූපයක් ගන්න: නිසි ආලෝකය සහ තියුණු අවධානය සහතික කරමින් කුරුඳු කුයිල්වල සමීප ඡායාරූප ගන්න.. 2.යෙදුමට රූපය උඩුගත කරන්න: මට්ටම හඳුනාගැනීමේ විශේෂාංගයට රූපය යොමු කරන්න. 3.මට්ටම සමාලෝචනය කරන්න: නිවැරදි මට්ටම සහ කුරුඳු ගුණාත්මකත්වය පරීක්ෂා කරන්න. 4.කරුණු තීරණය කරන්න: සැකසීම හෝ විකිණීම පිළිබඳ තීරණ ගන්නේ මෙම මට්ටම ඇසුරිනි.

# cinnamon_grades_content
source: Please upload an image or take a photo of your cinnamon bark or quills.
si: කරුණාකර ඔබේ කුරුඳු කුයිල්වල පින්තූරයක් උඩුගත කරන්න හෝ ඡායාරූපයක් ගන්න.

# cinnamon_grades_button0
source: Select File
si: ගොනුව තෝරන්න

# cinnamon_grades_or
source: Or
si: හෝ

# cinnamon_grades_button1
source: Open Camera and Take Photo
si: කැමරාව විවෘත කර රූපයක් ගන්න

# cinnamon_grades_button2
source: Predict the Grade
si: ශ්‍රේණිය තෝරාගන්න

source: predicted Grade
si: පුරෝකථනය කළ ශ්‍රේණිය

# grade_ditect_loading
source: Predicting Grade...
si: ශ්‍රේණිය පුරෝකථනය කරමින්...

source: Language
si: භාෂාව
